# for-loop 실습
print("for-loop 실습")

print("1부터 5까지 출력하기:")
'''
실습 1: 1부터 5까지 차례로 print로 출력하는 프로그램 만들기
'''
# for ... in range(...):
#   print(...)

print("3의 배수 출력하기:")
'''
실습 2: 1부터 100까지 숫자중에 3의 배수만 출력하는 프로그램 만들기
Hint 1: if를 이용해서 해당 숫자가 3의 배수인지 판별하고, 맞으면 출력하기
'''
# for ... in range(...):
#   if ...:
#       print(...)

print("최댓값 구하기")
'''
실습 3: 입력받은 숫자들 가운데 가장 큰 숫자를 출력하기
먼저, input을 이용해서 받을 숫자 횟수 n회 선택
n번 입력을 받고 그중에서 가장 큰 max를 출력하기
'''

# n = int(input(...))
# for ... in range(...):
#   if ...:
# print(...)
